IDEA StatiCa Open Model
ColumnDataEc2.GeometricImperfectionsULS Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Use calculation geometric imperfections for ULS
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool GeometricImperfectionsULS { get; set; }
Public Property GeometricImperfectionsULS As Boolean
	Get
	Set
public:
property bool GeometricImperfectionsULS {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ColumnDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace